; domain
(define (domain air-transport)
    (:predicates (LOAD ?x) (PLANE ?x) (AIRPORT ?x)
        (in ?x ?y) (at ?x ?y))
    
    (:action fly :parameters (?p ?from ?to)
        :precondition (and (PLANE ?p) (AIRPORT ?from) (AIRPORT ?to)
        (at ?p ?from))
        :effect (and (not (at ?p ?from)) (at ?p ?to)))
    
    (:action load :parameters (?c ?p ?a)
        :precondition (and (LOAD ?c) (PLANE ?p) (AIRPORT ?a)
        (at ?c ?a) (at ?p ?a))
        :effect (and (not (at ?c ?a)) (in ?c ?p)))

    (:action unload :parameters (?c ?p ?a)
        :precondition (and (PLANE ?p) (LOAD ?c) (AIRPORT ?a)
        (in ?c ?p) (at ?p ?a))
        :effect (and (at ?c ?a) (not (in ?c ?p)))))

; problem
(define (problem air-transport-task)
    
    (:domain air-transport)
    
    (:objects c1 c2 p1 p2 jfk sf0)
    
    (:init (LOAD c1) (LOAD c2)
        (PLANE p1) (PLANE p2)
        (AIRPORT jfk) (AIRPORT sf0)
        (at c1 sf0) (at c2 jfk) (at p1 sf0) (at p2 jfk))
    
    (:goal (and (at c1 jfk)
        (at c2 sf0))))

; plan
1. (load c2 p2 jfk)
   deleted: (at c2 jfk)
   added: (in c2 p2)
   goals met: 0 of 2
2. (fly p2 jfk sf0)
   deleted: (at p2 jfk)
   added: (at p2 sf0)
   goals met: 0 of 2
3. (unload c2 p2 sf0)
   deleted: (in c2 p2)
   added: (at c2 sf0)
   goals met: 1 of 2
4. (load c1 p2 sf0)
   deleted: (at c1 sf0)
   added: (in c1 p2)
   goals met: 1 of 2
5. (fly p2 sf0 jfk)
   deleted: (at p2 sf0)
   added: (at p2 jfk)
   goals met: 1 of 2
6. (unload c1 p2 jfk)
   deleted: (in c1 p2)
   added: (at c1 jfk)
   goals met: 2 of 2
